Docs/Reference/Content/images/dependencies/net10.0/mmd/alloverit-entityframeworkcore-pagination.mmd
flowchart LR
  alloverit-entityframeworkcore-pagination["AllOverIt.EntityFrameworkCore.Pagination"]
  alloverit-entityframeworkcore["AllOverIt.EntityFrameworkCore"]
  microsoft-entityframeworkcore-relational_10-0-9["Microsoft.EntityFrameworkCore.Relational<br>v10.0.9"]
  microsoft-entityframeworkcore_10-0-9["Microsoft.EntityFrameworkCore<br>v10.0.9"]
  microsoft-extensions-caching-memory_10-0-9["Microsoft.Extensions.Caching.Memory<br>v10.0.9"]
  microsoft-extensions-configuration-abstractions_10-0-9["Microsoft.Extensions.Configuration.Abstractions<br>v10.0.9"]
  microsoft-extensions-logging_10-0-9["Microsoft.Extensions.Logging<br>v10.0.9"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-pagination["AllOverIt.Pagination"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-9["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.9"]
  alloverit-serialization-binary["AllOverIt.Serialization.Binary"]
  alloverit-entityframeworkcore-pagination --> alloverit-entityframeworkcore
  alloverit-entityframeworkcore --> microsoft-entityframeworkcore-relational_10-0-9
  microsoft-entityframeworkcore-relational_10-0-9 --> microsoft-entityframeworkcore_10-0-9
  microsoft-entityframeworkcore-relational_10-0-9 --> microsoft-extensions-caching-memory_10-0-9
  microsoft-entityframeworkcore-relational_10-0-9 --> microsoft-extensions-configuration-abstractions_10-0-9
  microsoft-entityframeworkcore-relational_10-0-9 --> microsoft-extensions-logging_10-0-9
  alloverit-entityframeworkcore --> alloverit
  alloverit --> alloverit-assertion
  alloverit-entityframeworkcore-pagination --> alloverit-pagination
  alloverit-pagination --> microsoft-extensions-dependencyinjection-abstractions_10-0-9
  alloverit-pagination --> alloverit-serialization-binary
  alloverit-serialization-binary --> alloverit
  style microsoft-entityframeworkcore-relational_10-0-9 fill:#ADD8E6,opacity:0.8
  style microsoft-entityframeworkcore_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-caching-memory_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-abstractions_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging_10-0-9 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-9 fill:#ADD8E6,opacity:0.8
