Docs/Reference/Content/images/dependencies/net9.0/d2/alloverit-entityframeworkcore-pagination.d2
direction: left

aoi: AllOverIt
aoi.alloverit-entityframeworkcore-pagination: AllOverIt.EntityFrameworkCore.Pagination
aoi.alloverit-entityframeworkcore: AllOverIt.EntityFrameworkCore
microsoft-entityframeworkcore-relational_9-0-17: Microsoft.EntityFrameworkCore.Relational\nv9.0.17
microsoft-entityframeworkcore_9-0-17: Microsoft.EntityFrameworkCore\nv9.0.17
microsoft-extensions-caching-memory_9-0-17: Microsoft.Extensions.Caching.Memory\nv9.0.17
microsoft-extensions-configuration-abstractions_9-0-17: Microsoft.Extensions.Configuration.Abstractions\nv9.0.17
microsoft-extensions-logging_9-0-17: Microsoft.Extensions.Logging\nv9.0.17
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
aoi.alloverit-pagination: AllOverIt.Pagination
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
aoi.alloverit-serialization-binary: AllOverIt.Serialization.Binary
aoi.alloverit-entityframeworkcore <- aoi.alloverit-entityframeworkcore-pagination
microsoft-entityframeworkcore-relational_9-0-17 <- aoi.alloverit-entityframeworkcore
microsoft-entityframeworkcore_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
microsoft-extensions-caching-memory_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
microsoft-extensions-configuration-abstractions_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
microsoft-extensions-logging_9-0-17 <- microsoft-entityframeworkcore-relational_9-0-17
aoi.alloverit <- aoi.alloverit-entityframeworkcore
aoi.alloverit-assertion <- aoi.alloverit
aoi.alloverit-pagination <- aoi.alloverit-entityframeworkcore-pagination
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- aoi.alloverit-pagination
aoi.alloverit-serialization-binary <- aoi.alloverit-pagination
aoi.alloverit <- aoi.alloverit-serialization-binary
microsoft-entityframeworkcore-relational_9-0-17.style.fill: "#ADD8E6"
microsoft-entityframeworkcore-relational_9-0-17.style.opacity: 0.8
microsoft-entityframeworkcore_9-0-17.style.fill: "#FFEC96"
microsoft-entityframeworkcore_9-0-17.style.opacity: 0.8
microsoft-extensions-caching-memory_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-caching-memory_9-0-17.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_9-0-17.style.opacity: 0.8
microsoft-extensions-logging_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-logging_9-0-17.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
